espressif/esp-idf/examples/bluetooth/bluedroid/ble/ble_spp_client/sdkconfig.defaults.esp32c2
# Override some defaults so BT stack is enabled
# and WiFi disabled by default in this example
CONFIG_IDF_TARGET="esp32c2"
CONFIG_BT_ENABLED=y
# CONFIG_BT_BLE_50_FEATURES_SUPPORTED is not set
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y
# CONFIG_BT_LE_50_FEATURE_SUPPORT is not set
CONFIG_BT_LE_HCI_EVT_BUF_SIZE=257
